# BalusterPerTreadNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BalusterPlacement..::..BalusterPerTreadNumber Property
BalusterPlacement Class See Also
---
The number of balusters per tread.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public int BalusterPerTreadNumber { get; set; }
```

Visual Basic
---
```text
Public Property BalusterPerTreadNumber As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int BalusterPerTreadNumber {
	int get ();
	void set (int value);
}
```

# Remarks
Applicable only if UseBalusterPerTreadOnStairs is true.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for balusterPerTreadNumber is not positive. |

# See Also
BalusterPlacement Class
Autodesk.Revit.DB.Architecture Namespace